app/controllers/api/v1/properties_controller.rb

SELECT "properties".* FROM "properties"
---
  def index
    properties = Property.all

SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show
    property = Property.find_by(id: params[:id])

INSERT INTO "properties" ("rent_value", "bedrooms", "bathrooms", "property_type", "contract_type", "image", "description", "address", "pet_friendly", "area", "property_price", "maintenance_price", "user_id", "is_active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
---
  def create
    property = Property.new(
      rent_value: prop_params[:rent_value],
      bedrooms: prop_params[:bedrooms],
      bathrooms: prop_params[:bathrooms],
      property_type: prop_params[:property_type],
      contract_type: prop_params[:contract_type],
      image: prop_params[:image],
      description: prop_params[:description],
      address: prop_params[:address],
      pet_friendly: prop_params[:pet_friendly],
      area: prop_params[:area],
      property_price: prop_params[:property_price],
      maintenance_price: prop_params[:maintenance_price],
      user_id: prop_params[:user_id],
      is_active: prop_params[:is_active],
    )
    if property.save

SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "properties" SET "rent_value" = $1, "bedrooms" = $2, "bathrooms" = $3, "description" = $4, "address" = $5, "pet_friendly" = $6, "area" = $7, "maintenance_price" = $8, "user_id" = $9, "is_active" = $10, "updated_at" = $11 WHERE "properties"."id" = $12
---
  def update
    property = Property.find_by(id: params[:id])
    if property
      property.update(
        rent_value: params[:rent_value],
        bedrooms: params[:bedrooms],
        bathrooms: params[:bathrooms],
        property_type: params[:property_type],
        contract_type: params[:contract_type],
        image:  params[:image],
        description: params[:description],
        address: params[:address],
        pet_friendly: params[:pet_friendly],
        area: params[:area],
        property_price:  params[:property_price],
        maintenance_price: params[:maintenance_price],
        user_id: params[:user_id],
        is_active: params[:is_active]
      )

SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 3]]
---
  def destroy
    property = Property.find_by(id: params[:id])
    if property
      property.destroy