app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
  def index
    properties = Property.all

SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    property = Property.find_by(id: params[:id])

INSERT INTO "properties" ("rent_value", "bedrooms", "bathrooms", "property_type", "operation_type", "description", "url", "url_data", "address", "pet_friendly", "area", "property_price", "maintenance_price", "is_active", "longitude", "latitude", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
  def create
      property = Property.new(prop_params)
      property.urls = parse_url_data(params[:urls])
      property.user = current_user

      if property.save

SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update
    property = Property.find_by(id: params[:id])

SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 2]]
---
  def destroy
    property = Property.find_by(id: params[:id])
    if property
      property.destroy