app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "dante@mail.com"], ["password_digest", "[FILTERED]"], ["token", "[FILTERED]"], ["created_at", "2023-10-11 00:35:22.763463"], ["updated_at", "2023-10-11 00:35:22.763463"]]
---
  def create
    user = User.new(user_params)

    if user.save