app/controllers/user_properties_controller.rb

  def saved
    saved_properties = current_user.user_properties.where(saved: true).map(&:property)
---
SELECT "user_properties".* FROM "user_properties" WHERE "user_properties"."user_id" = $1 AND "user_properties"."saved" = $2  [["user_id", 1], ["saved", true]]

  def contacted
    contacted_properties = current_user.user_properties.where(contacted: true).map(&:property)
---
SELECT "user_properties".* FROM "user_properties" WHERE "user_properties"."user_id" = $1 AND "user_properties"."contacted" = $2  [["user_id", 2], ["contacted", true]]