app/controllers/user_properties_controller.rb

SELECT "user_properties".* FROM "user_properties" WHERE "user_properties"."user_id" = $1 AND "user_properties"."saved" = $2  [["user_id", 2], ["saved", true]]
---
  def index_saved
    saved_properties = current_user.user_properties.where(saved: true).map(&:property)

SELECT "user_properties".* FROM "user_properties" WHERE "user_properties"."user_id" = $1 AND "user_properties"."contacted" = $2  [["user_id", 2], ["contacted", true]]
---
  def index_contacted
    contacted_properties = current_user.user_properties.where(contacted: true).map(&:property)

SELECT "user_properties".* FROM "user_properties" WHERE "user_properties"."user_id" = $1 AND "user_properties"."id" = $2 LIMIT $3  [["user_id", 15], ["id", 32], ["LIMIT", 1]]
UPDATE "user_properties" SET "saved" = $1, "updated_at" = $2 WHERE "user_properties"."id" = $3  [["saved", true], ["updated_at", "2023-10-14 22:35:38.288024"], ["id", 32]]
---
  def update_saved
    user_property = current_user.user_properties.find(params[:id])
    user_property.update(saved: true)

SELECT "user_properties".* FROM "user_properties" WHERE "user_properties"."user_id" = $1 AND "user_properties"."id" = $2 LIMIT $3  [["user_id", 15], ["id", 33], ["LIMIT", 1]]
UPDATE "user_properties" SET "contacted" = $1, "updated_at" = $2 WHERE "user_properties"."id" = $3  [["contacted", true], ["updated_at", "2023-10-14 22:36:35.059362"], ["id", 31]]
---
  def update_contacted
    user_property = current_user.user_properties.find(params[:id])
    user_property.update(contacted: true)